def get_res_msg(key):
    return {
        "otp_sent": "کد یکبار مصرف به شماره شما ارسال شد.",
        "otp_send_attemps_expired": (
            "تعداد دفعات ارسال رمز یکبار مصرف به پایان رسیده است. "
            "لطفا بعد از چند دقیقه دوباره تلاش کنید."
        ),
        "otp_send_success": "کد یکبار مصرف به شماره شما ارسال شد.",
        "otp_not_found": "برای شماره وارد شده کد یکبار مصرفی یافت نشد.",
        "otp_expired": "زمان استفاده از کد یکبار مصرف به پایان رسیده است. لطفاً دوباره درخواست کد کنید.",
        "otp_diff_type": "نوع کد یکبار مصرف ارسال شده با درخواست شما متفاوت است.",
        "otp_attemps_expired": "تعداد تلاش‌های شما به پایان رسیده است. لطفاً دوباره درخواست کنید.",
        "otp_invalid": "کد وارد شده اشتباه است.",
        "otp_verify_success": "با موفقیت وارد شدید.",
        "phone_invalid": "شماره وارد شده اشتباه است. با فرمت 09123456789 شماره را وارد کنید.",
        "phone_valid": "شماره وارد شده صحیح است.",
        "phone_not_given": "شماره موبایل خود را وارد کنید.",
        "user_logout": "با موفقیت خارج شدید.",
    }.get(key, None)


def get_res_obj(is_success, key):
    return {"is_success": is_success, "msg_key": key, "msg": get_res_msg(key)}
